Documentation/Source/Vending_Design_Document.org
#+TITLE: Vending Design Document
#+EMAIL: NELA.Percy@gmail.com
#+AUTHOR: Percy, Amanda, Rob, Iya
#+DATE: May 2017
#+DESCRIPTION: Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress.
#+MACRO: DESCRIPTION Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress.
#+KEYWORDS: Zambia, Documentation, FFF branch
#+MACRO: KEYWORDS Zambia, Documentation, FFF branch
#+LANGUAGE: en
#+OPTIONS: \n:nil ^:nil timestamp:nil creator:nil H:2 num:2 toc:nil @:t ::nil |:t -:t todo:nil tasks:nil tags:nil <:t *:t author:t email:t skip:nil d:t f:t pri:t
#+STARTUP: fninline
#+SETUPFILE: "Headers/setupfile.org"
#+INCLUDE: "Headers/include.org"
#+TOC: headlines 2
#+LaTeX: \listoftables
#+LaTeX: \listoffigures
#+LaTeX: \newpage
#+LaTeX: \pagenumbering{arabic}
* General Design
  This is a working guide on how the vending portion of Zambia will be
  designed/changed.  Some of it is already in place, some has yet to
  be built.  This guide should have all the relevant bits in it so
  that all the stake-holders can have their say, and we are working
  off of one document.

  NOTE: when there is a - or a + next to things, it's because I asked
  that as a question, or made a supposition, and it was answered (by
  Amanda) so, for now at least the - is my side of the conversation
  and the + is her side of the conversation.
* Database Design
** Perennial
   These are the current values that should be migrated to the Zambia
   values if they are not already set.  The latest entries will be
   considered cannonical.  The ones of these in CongoDump will be more
   or less fixed and (currently) take an act of Vendor Coordinator (or
   other back-end Zambia person) to update.  

   The ones of these in Bios can be updated by the
   Vendors. times_at_fff_untracked should also be fixed.  Not sure
   about vendor_type.  If their "DBA" name is different from their
   vendor_business_name then, that can go in the bio field.

   The logo submission has yet to be determined, but I figure it's
   going to be handled along the same lines as the picture that we
   use for Presenters.
*** id
    CongoDump.badgeid
*** vendor_address
    CongoDump.postaddress1 and CongoDump.postaddress2
*** vendor_business_name
    CongoDump.badgename, Bios - badgeid=id, biotype=name
*** vendor_city
    CongoDump.postcity
*** vendor_contact_email
    CongoDump.email
*** vendor_contact_name
    CongoDump.firstname, CongoDump.lastname
*** vendor_contact_phone
    CongoDump.phone
*** vendor_country
    CongoDump.postcountry
*** vendor_description
    Bios - badgeid=id,, biotype=bio 
*** vendor_state
    CongoDump.poststate
*** vendor_website
    Bios - badgeid=id, biotype=url
*** vendor_twitter
    Bios - badgeid=id, biotype=twitter
*** vendor_facebook
    Bios - badgeid=id, biotype=facebook
*** vendor_fetlife
    Bios - badgeid=id, biotype=fetlife
*** vendor_zipcode
    CongoDump.postzip
*** vendor_type
    - New? possibly a short list of possible with a mapping to the
      vendor?
    - Might also include "community table" as a type?  If this isn't a
      short list of pickable things, we might want to make another
      table field "vendor/community table" with allowable "V" or "C"
      as part of the enum.
*** times_at_fff_untracked
    The number of times they vended at the fff that we currently don't
    have in the database, so that the generated number below can be
    (more) accurately generated.  As we add more instances (as I find
    them) this should probably get adjusted, so it's not artificially
    inflated. 
