Documentation/Vending_Design_Document.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Vending Design Document</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy, Amanda, Rob, Iya" />
<meta  name="description" content="Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Vending Design Document</h1>
<p>
Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress.
</p>
<p>
Vending Design Document
</p>
<p>
Percy, Amanda, Rob, Iya &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. General Design</a></li>
<li><a href="#sec-2">2. Database Design</a>
<ul>
<li><a href="#sec-2-1">2.1. Perennial</a></li>
<li><a href="#sec-2-2">2.2. Annual</a></li>
<li><a href="#sec-2-3">2.3. Missing</a></li>
<li><a href="#sec-2-4">2.4. Generated</a></li>
<li><a href="#sec-2-5">2.5. Structture</a></li>
<li><a href="#sec-2-6">2.6. Still Unknown</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Front End</a>
<ul>
<li><a href="#sec-3-1">3.1. Available Pages</a></li>
<li><a href="#sec-3-2">3.2. Flow</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General Design</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a working guide on how the vending portion of Zambia will be
designed/changed.  Some of it is already in place, some has yet to
be built.  This guide should have all the relevant bits in it so
that all the stake-holders can have their say, and we are working
off of one document.
</p>

<p>
NOTE: when there is a - or a + next to things, it's because I asked
that as a question, or made a supposition, and it was answered (by
Amanda) so, for now at least the - is my side of the conversation
and the + is her side of the conversation.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Database Design</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Perennial</h3>
<div class="outline-text-3" id="text-2-1">
<p>
These are the current values that should be migrated to the Zambia
values if they are not already set.  The latest entries will be
considered cannonical.  The ones of these in CongoDump will be more
or less fixed and (currently) take an act of Vendor Coordinator (or
other back-end Zambia person) to update.  
</p>

<p>
The ones of these in Bios can be updated by the
Vendors. times_at_fff_untracked should also be fixed.  Not sure
about vendor_type.  If their "DBA" name is different from their
vendor_business_name then, that can go in the bio field.
</p>

<p>
The logo submission has yet to be determined, but I figure it's
going to be handled along the same lines as the picture that we
use for Presenters.
</p>
</div>
<ul class="org-ul"><li>id<br  /><div class="outline-text-4" id="text-2-1-1">
<p>
CongoDump.badgeid
</p>
</div>
</li>

<li>vendor_address<br  /><div class="outline-text-4" id="text-2-1-2">
<p>
CongoDump.postaddress1 and CongoDump.postaddress2
</p>
</div>
</li>

<li>vendor_business_name<br  /><div class="outline-text-4" id="text-2-1-3">
<p>
CongoDump.badgename, Bios - badgeid=id, biotype=name
</p>
</div>
</li>

<li>vendor_city<br  /><div class="outline-text-4" id="text-2-1-4">
<p>
CongoDump.postcity
</p>
</div>
</li>

<li>vendor_contact_email<br  /><div class="outline-text-4" id="text-2-1-5">
<p>
CongoDump.email
</p>
</div>
</li>

<li>vendor_contact_name<br  /><div class="outline-text-4" id="text-2-1-6">
<p>
CongoDump.firstname, CongoDump.lastname
</p>
</div>
</li>

<li>vendor_contact_phone<br  /><div class="outline-text-4" id="text-2-1-7">
<p>
CongoDump.phone
</p>
</div>
</li>

<li>vendor_country<br  /><div class="outline-text-4" id="text-2-1-8">
<p>
CongoDump.postcountry
</p>
</div>
</li>

<li>vendor_description<br  /><div class="outline-text-4" id="text-2-1-9">
<p>
Bios - badgeid=id,, biotype=bio 
</p>
</div>
</li>

<li>vendor_state<br  /><div class="outline-text-4" id="text-2-1-10">
<p>
CongoDump.poststate
</p>
</div>
</li>

<li>vendor_website<br  /><div class="outline-text-4" id="text-2-1-11">
<p>
Bios - badgeid=id, biotype=url
</p>
</div>
</li>

<li>vendor_twitter<br  /><div class="outline-text-4" id="text-2-1-12">
<p>
Bios - badgeid=id, biotype=twitter
</p>
</div>
</li>

<li>vendor_facebook<br  /><div class="outline-text-4" id="text-2-1-13">
<p>
Bios - badgeid=id, biotype=facebook
</p>
</div>
</li>

<li>vendor_fetlife<br  /><div class="outline-text-4" id="text-2-1-14">
<p>
Bios - badgeid=id, biotype=fetlife
</p>
</div>
</li>

<li>vendor_zipcode<br  /><div class="outline-text-4" id="text-2-1-15">
<p>
CongoDump.postzip
</p>
</div>
</li>

<li>vendor_type<br  /><div class="outline-text-4" id="text-2-1-16">
<ul class="org-ul">
<li>New? possibly a short list of possible with a mapping to the
vendor?
</li>
<li>Might also include "community table" as a type?  If this isn't a
short list of pickable things, we might want to make another
table field "vendor/community table" with allowable "V" or "C"
as part of the enum.
</li>
</ul>
</div>
</li>

<li>times_at_fff_untracked<br  /><div class="outline-text-4" id="text-2-1-17">
<p>
The number of times they vended at the fff that we currently don't
have in the database, so that the generated number below can be
(more) accurately generated.  As we add more instances (as I find
them) this should probably get adjusted, so it's not artificially
inflated. 
</p>
</div>
</li></ul>
</div>
