Documentation/Source/Vending_Design_Document.tex
\documentclass[captions=tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\setcounter{secnumdepth}{2}
\author{Percy, Amanda, Rob, Iya\thanks{NELA.Percy@gmail.com}}
\date{May 2017}
\title{Vending Design Document}
\hypersetup{
  pdfkeywords={Zambia, Documentation, FFF branch},
  pdfsubject={Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress.},
  pdfcreator={}}
\begin{document}

\maketitle
\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{}
\cfoot{}
\rfoot{}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}
Zambia is a piece of Con Management Software.  This document is a guide to building the Vendor System for the Zambia FFF-branch instance.  This is still a work in progress.
\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{1pt}
\chead{
Vending Design Document
}
\lfoot{
Percy, Amanda, Rob, Iya <NELA.Percy@gmail.com>
}
\rfoot{\thepage}
\setcounter{tocdepth}{2}
\tableofcontents
\listoftables
\listoffigures
\newpage
\pagenumbering{arabic}
\section{General Design}
\label{sec-1}
This is a working guide on how the vending portion of Zambia will be
designed/changed.  Some of it is already in place, some has yet to
be built.  This guide should have all the relevant bits in it so
that all the stake-holders can have their say, and we are working
off of one document.

NOTE: when there is a - or a + next to things, it's because I asked
that as a question, or made a supposition, and it was answered (by
Amanda) so, for now at least the - is my side of the conversation
and the + is her side of the conversation.

\section{Database Design}
\label{sec-2}
\subsection{Perennial}
\label{sec-2-1}
These are the current values that should be migrated to the Zambia
values if they are not already set.  The latest entries will be
considered cannonical.  The ones of these in CongoDump will be more
or less fixed and (currently) take an act of Vendor Coordinator (or
other back-end Zambia person) to update.  

The ones of these in Bios can be updated by the
Vendors. times\_at\_fff\_untracked should also be fixed.  Not sure
about vendor\_type.  If their "DBA" name is different from their
vendor\_business\_name then, that can go in the bio field.

The logo submission has yet to be determined, but I figure it's
going to be handled along the same lines as the picture that we
use for Presenters.
\begin{itemize}
\item id
\label{sec-2-1-1}
CongoDump.badgeid

\item vendor\_address
\label{sec-2-1-2}
CongoDump.postaddress1 and CongoDump.postaddress2

\item vendor\_business\_name
\label{sec-2-1-3}
CongoDump.badgename, Bios - badgeid=id, biotype=name

\item vendor\_city
\label{sec-2-1-4}
CongoDump.postcity

\item vendor\_contact\_email
\label{sec-2-1-5}
CongoDump.email

\item vendor\_contact\_name
\label{sec-2-1-6}
CongoDump.firstname, CongoDump.lastname

\item vendor\_contact\_phone
\label{sec-2-1-7}
CongoDump.phone

\item vendor\_country
\label{sec-2-1-8}
CongoDump.postcountry

\item vendor\_description
\label{sec-2-1-9}
Bios - badgeid=id,, biotype=bio 

\item vendor\_state
\label{sec-2-1-10}
CongoDump.poststate

\item vendor\_website
\label{sec-2-1-11}
Bios - badgeid=id, biotype=url

\item vendor\_twitter
\label{sec-2-1-12}
Bios - badgeid=id, biotype=twitter

\item vendor\_facebook
\label{sec-2-1-13}
Bios - badgeid=id, biotype=facebook

\item vendor\_fetlife
\label{sec-2-1-14}
Bios - badgeid=id, biotype=fetlife

\item vendor\_zipcode
\label{sec-2-1-15}
CongoDump.postzip

\item vendor\_type
\label{sec-2-1-16}
\begin{itemize}
\item New? possibly a short list of possible with a mapping to the
vendor?
\item Might also include "community table" as a type?  If this isn't a
short list of pickable things, we might want to make another
table field "vendor/community table" with allowable "V" or "C"
as part of the enum.
\end{itemize}

\item times\_at\_fff\_untracked
\label{sec-2-1-17}
The number of times they vended at the fff that we currently don't
have in the database, so that the generated number below can be
(more) accurately generated.  As we add more instances (as I find
them) this should probably get adjusted, so it's not artificially
inflated.
\end{itemize}
