Documentation/Source/Vending_Design_Document.org
** Annual
   Most of these have to either be created, or co-opted, since the way
   that it was being done before is too baroque and complicated.  Easy
   enough to simply make new tables, and resuse little bits, instead
   of trying to force everything into the other workflow, as we did on
   an "emergency" and "emergant" basis, originally.
*** id - varchar(15)
    linked to Participants.badgeid
*** conid - int(11)
    linked to ConInfo.conid
*** created - datetime
    - when applied I think?
    + CORRECT
*** digital_advertising - Y/N (enum)
    - y/n or $ or type? 
    - do they want it? or how much?
    +  JUST A Y/N
*** fff_sponsorship - Y/N (enum)
    - y/n or $ or level? 
    - will they sponsor us?
    + JUST A Y/N
*** print_advertising - Y/N (enum)
    - y/n or $ or type? 
    - do they want it?
    + JUST A Y/N
*** updated - timestamp
    - most recently updated, I believe
    + CORRECT
*** vendor_acknowledgement - varchar(25) (signature)
    - Vendor acknowledges ... something?
    + VENDOR ACKNOWLEDGES THEY AGREE TO OUR TERMS AND CONDITIONS -
      THIS SHOULD BE AGREED TO ANNUALLY 
*** vendor_additional_notes / additional_information - text
    - this might also want to be perenial as well, perhaps?
    + ANNUAL ONLY; THIS IS REGARDING REQUESTS (EX:  FUR ALLERGY, WALL,
      ETC)
*** vendor_amenities_foo - ?? (see also VendorFeatures)
    - A variety of possible fields?  How is this  used?
      - 6ft_table
      - corner_endcap
      - extra_badges
      - number_of_chairs
      - shared_electrical 8ft_tables
    +  RIGHT NOW IT'S SPLIT INTO MULTIPLE LINES WITH MULTI OPTIONS.  #
       OF TABLES, # OF CHAIRS, CORNER/END CAP, ELECTRICAL, EXTRA
       BADGES 
*** vendor_contract - varchar(5)
    - How is this used?
    + THIS IS INITIALS TO STATE THEY READ AND AGREE TO OUR TERMS ALREADY ABOVE
*** vendor_invoiced - Y/N (enum)
    - Were they invoced?
    + YUP
*** vendor_location - ??
    - Where we put them.
    + YUP
    - This might want to be slightly more complex, building, room, and booth-number
*** vendor_payment_adjustment - decimal(13,4)
    - Adjustments to the bill
    + YUP
*** vendor_payment_amount - decimal(13,4)
    - amount they paid, should match invoiced amounts
    + YUP
*** vendor_payment_received - Y/N (enum)
    - check box?
    + YES
    - default "N" or maybe blank?
*** vendor_preferred_space - ?? (see also VendorSpaces)
    - Where they would like to be put.
    + NO - THIS IS BOOTH SIZE (SINGLE, DOUBLE, ETC)
*** vendor_loadin_self_carry - Y/N (enum)
    - will they?
    - This should be Y/n, right?
    + YES
*** vendor_sponsorship_package  - ??
    - what package they wanted?  They actually bought?
    + THIS IS THE Y/N ABOVE
    - if this is redundant it should be removed.  If it is the same as
      what is in missing, below, then ... perhaps not so missing after
      all?
*** vendor_status / status - Denied/Approved/Accepted/Approved/Paid (enum)
    + STATUS
    + DENIED, APPROVED, ACCEPTED, APPROVED AND PAID
    - Approved is in twice?  Should it be 4, Denied, Approved,
      Accepted, Paid?  I'd also add "Proposed" or the like?
*** rejected_reason - text
    + KEEP, WOULD BE SUBJECT TO CHANGE UNLESS VENDOR IS BANNER
** Missing
   These are values that I think we need, that don't seem to actually
   exist anywhere else, and should probably be at least tracked, if
   not having several layers to them, so that they can be figured into
   things like costs, and historical data.
*** vendor_sponsor_level
    - This might be the vendor_sponsorship_package piece?
    - This might get more complex, depending on the offerings
*** digital_advertising_level
    - This might need to be a table of some sort, based on the
      offerings
*** print_advertising_level
    - This might need to be a table of some sort, based on the
      offerings
