Documentation/Vending_Design_Document.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Annual</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Most of these have to either be created, or co-opted, since the way
that it was being done before is too baroque and complicated.  Easy
enough to simply make new tables, and resuse little bits, instead
of trying to force everything into the other workflow, as we did on
an "emergency" and "emergant" basis, originally.
</p>
</div>
<ul class="org-ul"><li>id - varchar(15)<br  /><div class="outline-text-4" id="text-2-2-1">
<p>
linked to Participants.badgeid
</p>
</div>
</li>

<li>conid - int(11)<br  /><div class="outline-text-4" id="text-2-2-2">
<p>
linked to ConInfo.conid
</p>
</div>
</li>

<li>created - datetime<br  /><div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>when applied I think?
</li>
<li>CORRECT
</li>
</ul>
</div>
</li>

<li>digital_advertising - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>y/n or $ or type? 
</li>
<li>do they want it? or how much?
</li>
<li>JUST A Y/N
</li>
</ul>
</div>
</li>

<li>fff_sponsorship - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>y/n or $ or level? 
</li>
<li>will they sponsor us?
</li>
<li>JUST A Y/N
</li>
</ul>
</div>
</li>

<li>print_advertising - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-6">
<ul class="org-ul">
<li>y/n or $ or type? 
</li>
<li>do they want it?
</li>
<li>JUST A Y/N
</li>
</ul>
</div>
</li>

<li>updated - timestamp<br  /><div class="outline-text-4" id="text-2-2-7">
<ul class="org-ul">
<li>most recently updated, I believe
</li>
<li>CORRECT
</li>
</ul>
</div>
</li>

<li>vendor_acknowledgement - varchar(25) (signature)<br  /><div class="outline-text-4" id="text-2-2-8">
<ul class="org-ul">
<li>Vendor acknowledges &#x2026; something?
</li>
<li>VENDOR ACKNOWLEDGES THEY AGREE TO OUR TERMS AND CONDITIONS -
THIS SHOULD BE AGREED TO ANNUALLY 
</li>
</ul>
</div>
</li>

<li>vendor_additional_notes / additional_information - text<br  /><div class="outline-text-4" id="text-2-2-9">
<ul class="org-ul">
<li>this might also want to be perenial as well, perhaps?
</li>
<li>ANNUAL ONLY; THIS IS REGARDING REQUESTS (EX:  FUR ALLERGY, WALL,
ETC)
</li>
</ul>
</div>
</li>

<li>vendor_amenities_foo - ?? (see also VendorFeatures)<br  /><div class="outline-text-4" id="text-2-2-10">
<ul class="org-ul">
<li>A variety of possible fields?  How is this  used?
<ul class="org-ul">
<li>6ft_table
</li>
<li>corner_endcap
</li>
<li>extra_badges
</li>
<li>number_of_chairs
</li>
<li>shared_electrical 8ft_tables
</li>
</ul>
</li>
<li>RIGHT NOW IT'S SPLIT INTO MULTIPLE LINES WITH MULTI OPTIONS.  #
OF TABLES, # OF CHAIRS, CORNER/END CAP, ELECTRICAL, EXTRA
BADGES 
</li>
</ul>
</div>
</li>

<li>vendor_contract - varchar(5)<br  /><div class="outline-text-4" id="text-2-2-11">
<ul class="org-ul">
<li>How is this used?
</li>
<li>THIS IS INITIALS TO STATE THEY READ AND AGREE TO OUR TERMS ALREADY ABOVE
</li>
</ul>
</div>
</li>

<li>vendor_invoiced - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-12">
<ul class="org-ul">
<li>Were they invoced?
</li>
<li>YUP
</li>
</ul>
</div>
</li>

<li>vendor_location - ??<br  /><div class="outline-text-4" id="text-2-2-13">
<ul class="org-ul">
<li>Where we put them.
</li>
<li>YUP
</li>
<li>This might want to be slightly more complex, building, room, and booth-number
</li>
</ul>
</div>
</li>

<li>vendor_payment_adjustment - decimal(13,4)<br  /><div class="outline-text-4" id="text-2-2-14">
<ul class="org-ul">
<li>Adjustments to the bill
</li>
<li>YUP
</li>
</ul>
</div>
</li>

<li>vendor_payment_amount - decimal(13,4)<br  /><div class="outline-text-4" id="text-2-2-15">
<ul class="org-ul">
<li>amount they paid, should match invoiced amounts
</li>
<li>YUP
</li>
</ul>
</div>
</li>

<li>vendor_payment_received - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-16">
<ul class="org-ul">
<li>check box?
</li>
<li>YES
</li>
<li>default "N" or maybe blank?
</li>
</ul>
</div>
</li>

<li>vendor_preferred_space - ?? (see also VendorSpaces)<br  /><div class="outline-text-4" id="text-2-2-17">
<ul class="org-ul">
<li>Where they would like to be put.
</li>
<li>NO - THIS IS BOOTH SIZE (SINGLE, DOUBLE, ETC)
</li>
</ul>
</div>
</li>

<li>vendor_loadin_self_carry - Y/N (enum)<br  /><div class="outline-text-4" id="text-2-2-18">
<ul class="org-ul">
<li>will they?
</li>
<li>This should be Y/n, right?
</li>
<li>YES
</li>
</ul>
</div>
</li>

<li>vendor_sponsorship_package  - ??<br  /><div class="outline-text-4" id="text-2-2-19">
<ul class="org-ul">
<li>what package they wanted?  They actually bought?
</li>
<li>THIS IS THE Y/N ABOVE
</li>
<li>if this is redundant it should be removed.  If it is the same as
what is in missing, below, then &#x2026; perhaps not so missing after
all?
</li>
</ul>
</div>
</li>

<li>vendor_status / status - Denied/Approved/Accepted/Approved/Paid (enum)<br  /><div class="outline-text-4" id="text-2-2-20">
<ul class="org-ul">
<li>STATUS
</li>
<li>DENIED, APPROVED, ACCEPTED, APPROVED AND PAID
</li>
<li>Approved is in twice?  Should it be 4, Denied, Approved,
Accepted, Paid?  I'd also add "Proposed" or the like?
</li>
</ul>
</div>
</li>

<li>rejected_reason - text<br  /><div class="outline-text-4" id="text-2-2-21">
<ul class="org-ul">
<li>KEEP, WOULD BE SUBJECT TO CHANGE UNLESS VENDOR IS BANNER
</li>
</ul>
</div>
</li></ul>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Missing</h3>
<div class="outline-text-3" id="text-2-3">
<p>
These are values that I think we need, that don't seem to actually
exist anywhere else, and should probably be at least tracked, if
not having several layers to them, so that they can be figured into
things like costs, and historical data.
</p>
</div>
<ul class="org-ul"><li>vendor_sponsor_level<br  /><div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>This might be the vendor_sponsorship_package piece?
</li>
<li>This might get more complex, depending on the offerings
</li>
</ul>
</div>
</li>

<li>digital_advertising_level<br  /><div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>This might need to be a table of some sort, based on the
offerings
</li>
</ul>
</div>
</li>

<li>print_advertising_level<br  /><div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>This might need to be a table of some sort, based on the
offerings
</li>
</ul>
</div>
</li>

<li>vendor_actual_space<br  /><div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
