Documentation/Source/Vending_Design_Document.tex

\subsection{Annual}
\label{sec-2-2}
Most of these have to either be created, or co-opted, since the way
that it was being done before is too baroque and complicated.  Easy
enough to simply make new tables, and resuse little bits, instead
of trying to force everything into the other workflow, as we did on
an "emergency" and "emergant" basis, originally.
\begin{itemize}
\item id - varchar(15)
\label{sec-2-2-1}
linked to Participants.badgeid

\item conid - int(11)
\label{sec-2-2-2}
linked to ConInfo.conid

\item created - datetime
\label{sec-2-2-3}
\begin{itemize}
\item when applied I think?
\item CORRECT
\end{itemize}

\item digital\_advertising - Y/N (enum)
\label{sec-2-2-4}
\begin{itemize}
\item y/n or \$ or type?
\item do they want it? or how much?
\item JUST A Y/N
\end{itemize}

\item fff\_sponsorship - Y/N (enum)
\label{sec-2-2-5}
\begin{itemize}
\item y/n or \$ or level?
\item will they sponsor us?
\item JUST A Y/N
\end{itemize}

\item print\_advertising - Y/N (enum)
\label{sec-2-2-6}
\begin{itemize}
\item y/n or \$ or type?
\item do they want it?
\item JUST A Y/N
\end{itemize}

\item updated - timestamp
\label{sec-2-2-7}
\begin{itemize}
\item most recently updated, I believe
\item CORRECT
\end{itemize}

\item vendor\_acknowledgement - varchar(25) (signature)
\label{sec-2-2-8}
\begin{itemize}
\item Vendor acknowledges \ldots{} something?
\item VENDOR ACKNOWLEDGES THEY AGREE TO OUR TERMS AND CONDITIONS -
THIS SHOULD BE AGREED TO ANNUALLY
\end{itemize}

\item vendor\_additional\_notes / additional\_information - text
\label{sec-2-2-9}
\begin{itemize}
\item this might also want to be perenial as well, perhaps?
\item ANNUAL ONLY; THIS IS REGARDING REQUESTS (EX:  FUR ALLERGY, WALL,
ETC)
\end{itemize}

\item vendor\_amenities\_foo - ?? (see also VendorFeatures)
\label{sec-2-2-10}
\begin{itemize}
\item A variety of possible fields?  How is this  used?
\begin{itemize}
\item 6ft\_table
\item corner\_endcap
\item extra\_badges
\item number\_of\_chairs
\item shared\_electrical 8ft\_tables
\end{itemize}
\item RIGHT NOW IT'S SPLIT INTO MULTIPLE LINES WITH MULTI OPTIONS.  \#
OF TABLES, \# OF CHAIRS, CORNER/END CAP, ELECTRICAL, EXTRA
BADGES
\end{itemize}

\item vendor\_contract - varchar(5)
\label{sec-2-2-11}
\begin{itemize}
\item How is this used?
\item THIS IS INITIALS TO STATE THEY READ AND AGREE TO OUR TERMS ALREADY ABOVE
\end{itemize}

\item vendor\_invoiced - Y/N (enum)
\label{sec-2-2-12}
\begin{itemize}
\item Were they invoced?
\item YUP
\end{itemize}

\item vendor\_location - ??
\label{sec-2-2-13}
\begin{itemize}
\item Where we put them.
\item YUP
\item This might want to be slightly more complex, building, room, and booth-number
\end{itemize}

\item vendor\_payment\_adjustment - decimal(13,4)
\label{sec-2-2-14}
\begin{itemize}
\item Adjustments to the bill
\item YUP
\end{itemize}

\item vendor\_payment\_amount - decimal(13,4)
\label{sec-2-2-15}
\begin{itemize}
\item amount they paid, should match invoiced amounts
\item YUP
\end{itemize}

\item vendor\_payment\_received - Y/N (enum)
\label{sec-2-2-16}
\begin{itemize}
\item check box?
\item YES
\item default "N" or maybe blank?
\end{itemize}

\item vendor\_preferred\_space - ?? (see also VendorSpaces)
\label{sec-2-2-17}
\begin{itemize}
\item Where they would like to be put.
\item NO - THIS IS BOOTH SIZE (SINGLE, DOUBLE, ETC)
\end{itemize}

\item vendor\_loadin\_self\_carry - Y/N (enum)
\label{sec-2-2-18}
\begin{itemize}
\item will they?
\item This should be Y/n, right?
\item YES
\end{itemize}

\item vendor\_sponsorship\_package  - ??
\label{sec-2-2-19}
\begin{itemize}
\item what package they wanted?  They actually bought?
\item THIS IS THE Y/N ABOVE
\item if this is redundant it should be removed.  If it is the same as
what is in missing, below, then \ldots{} perhaps not so missing after
all?
\end{itemize}

\item vendor\_status / status - Denied/Approved/Accepted/Approved/Paid (enum)
\label{sec-2-2-20}
\begin{itemize}
\item STATUS
\item DENIED, APPROVED, ACCEPTED, APPROVED AND PAID
\item Approved is in twice?  Should it be 4, Denied, Approved,
Accepted, Paid?  I'd also add "Proposed" or the like?
\end{itemize}

\item rejected\_reason - text
\label{sec-2-2-21}
\begin{itemize}
\item KEEP, WOULD BE SUBJECT TO CHANGE UNLESS VENDOR IS BANNER
\end{itemize}
\end{itemize}

\subsection{Missing}
\label{sec-2-3}
These are values that I think we need, that don't seem to actually
exist anywhere else, and should probably be at least tracked, if
not having several layers to them, so that they can be figured into
things like costs, and historical data.
\begin{itemize}
\item vendor\_sponsor\_level
\label{sec-2-3-1}
\begin{itemize}
\item This might be the vendor\_sponsorship\_package piece?
\item This might get more complex, depending on the offerings
\end{itemize}

\item digital\_advertising\_level
\label{sec-2-3-2}
\begin{itemize}
\item This might need to be a table of some sort, based on the
offerings
\end{itemize}

\item print\_advertising\_level
\label{sec-2-3-3}
\begin{itemize}
\item This might need to be a table of some sort, based on the
offerings
\end{itemize}

\item vendor\_actual\_space
\label{sec-2-3-4}
\begin{itemize}
