Documentation/Source/Vending_Design_Document.org
*** vendor_actual_space
    - single, double, room, etc. probably based on the same
      VendorSpaces/VendorHasVendorSpace etc.
*** vendor_location_requests
    - although this might be under vendor notes?
** Generated
   These values would not actually be stored anywhere, but generated
   for various purposes, from other information collected in the
   database, rather than simple values.  The Vendor Invoice Amount
   should also go along with the Vendor Invoice, which lists all the
   things they are paying for, and interfaces with our credit-card
   system.
*** vendor_invoice_amount - decimal(13,4)
    - Money
    + YUP
    - possibly a geneerated field, as opposed to a stored one, based
      on the varieties chosen in vendor_amenites,
      vendor_payment_adjustment, vendor_actual_space and others?
*** times_at_fff 
    - currently a freeform field, should probably be generated, with a
      special number that adds in, for (currently) untracked events.
    + SOUNDS GOOD
    - Base figure above in perennial
** Structture
   These are the proposed new tables or modifications to existing
   tables that the data will be collected in.  Mostly interesting for
   building purposes, but also for those curious on how things operate
   under the hood, because, I like sharing that way, as opposed to
   keeping things secret and cryptic.  Yes, I know it's called "code"
   because we didn't want you to know what it did, but ... 
*** Vendor Constants
    - Most of these (as listed) are already in the CongoDump table.
    - Two need their own table:
      - vendor_type
        possibly a short list of possible with a mapping to the
        vendor, so might be another table
      - times_at_fff_untracked - int(3)
*** Vendor Yearly Variables
    - Most just are, as specified in this table
    - Some might be cross-references to the other tables below, or be
      in the other tables entirely.
*** Vendor Features
    Probably just a tweak to this table, and might need to be a
    "standard set" and a "this year set" like BaseFeatures and
    Features does as well as BaseServices and Services does and a
    repurposing of "SessionHasVendorFeature" to
    "VendorHasVendorFeature"
*** Vendor Spaces
    Probably just a tweak to this table, and might need to be a
    "standard set" and a "this year set" like BaseFeatures and
    Features does as well as BaseServices and Services does and a
    repurposing of "SessionHasVendorSpace" to "VendorHasVendorSpace"
*** Vendor Location
    Might be it's own table, with conid (linked), badgeid (linked),
    building, floor, room (possibly linked), and booth_number, and
    then code around it so blanks just don't get reported (aka, if
    they are a room vendor, their booth_number might not be listed,
    but if there are several vendors in a room, it might be.)  This
    might also allow ties to maps, and possibly the redraw of maps.
*** Vendor Status
    Might want to be it's own table as a mapping, so searches, and
    display_order could be set.
*** Vendor Sponsorship Package/vendor_sponsor_level
    These three would need to be determined.
*** digital_advertising_level
    These three would need to be determined.
*** print_advertising_level
    These three would need to be determined.
** Still Unknown
   These are the variables that exist already in the other usage
   space, that I still don't have a handle on.  More explination would
   be very useful.
*** created_by - number
    - Not sure what this does?
    + I THINK IT"S VENDORS NAME VS. I UPDATED, ETC
    - So ... how should it be expressed/tracked?
*** ordering_count - number
    - Another random number?
    + YES
    - Should it be kept?  Removed, what is it's state?  What is it's
      purpose?
* Front End
** Available Pages
   This should be the comprehensive list of all the pages that either
   the vendors/community table folk need to interact with or those who
   manage them (the Div Head) needs to interact with.
*** Returning Vendor sign-in
    By number or email address.
*** Returning Community Table sign-in
    By number or email address.  Might simply be switched on one of
    the values in the vending type or on it's own value, and just have
    one place to go?  Since we are collecting pretty much the same
    information for them both?  Or should I be separating them out?
