Documentation/Vending_Design_Document.html
<li>single, double, room, etc. probably based on the same
VendorSpaces/VendorHasVendorSpace etc.
</li>
</ul>
</div>
</li>

<li>vendor_location_requests<br  /><div class="outline-text-4" id="text-2-3-5">
<ul class="org-ul">
<li>although this might be under vendor notes?
</li>
</ul>
</div>
</li></ul>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Generated</h3>
<div class="outline-text-3" id="text-2-4">
<p>
These values would not actually be stored anywhere, but generated
for various purposes, from other information collected in the
database, rather than simple values.  The Vendor Invoice Amount
should also go along with the Vendor Invoice, which lists all the
things they are paying for, and interfaces with our credit-card
system.
</p>
</div>
<ul class="org-ul"><li>vendor_invoice_amount - decimal(13,4)<br  /><div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>Money
</li>
<li>YUP
</li>
<li>possibly a geneerated field, as opposed to a stored one, based
on the varieties chosen in vendor_amenites,
vendor_payment_adjustment, vendor_actual_space and others?
</li>
</ul>
</div>
</li>

<li>times_at_fff<br  /><div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>currently a freeform field, should probably be generated, with a
special number that adds in, for (currently) untracked events.
</li>
<li>SOUNDS GOOD
</li>
<li>Base figure above in perennial
</li>
</ul>
</div>
</li></ul>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Structture</h3>
<div class="outline-text-3" id="text-2-5">
<p>
These are the proposed new tables or modifications to existing
tables that the data will be collected in.  Mostly interesting for
building purposes, but also for those curious on how things operate
under the hood, because, I like sharing that way, as opposed to
keeping things secret and cryptic.  Yes, I know it's called "code"
because we didn't want you to know what it did, but &#x2026; 
</p>
</div>
<ul class="org-ul"><li>Vendor Constants<br  /><div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li>Most of these (as listed) are already in the CongoDump table.
</li>
<li>Two need their own table:
<ul class="org-ul">
<li>vendor_type
possibly a short list of possible with a mapping to the
vendor, so might be another table
</li>
<li>times_at_fff_untracked - int(3)
</li>
</ul>
</li>
</ul>
</div>
</li>

<li>Vendor Yearly Variables<br  /><div class="outline-text-4" id="text-2-5-2">
<ul class="org-ul">
<li>Most just are, as specified in this table
</li>
<li>Some might be cross-references to the other tables below, or be
in the other tables entirely.
</li>
</ul>
</div>
</li>

<li>Vendor Features<br  /><div class="outline-text-4" id="text-2-5-3">
<p>
Probably just a tweak to this table, and might need to be a
"standard set" and a "this year set" like BaseFeatures and
Features does as well as BaseServices and Services does and a
repurposing of "SessionHasVendorFeature" to
"VendorHasVendorFeature"
</p>
</div>
</li>

<li>Vendor Spaces<br  /><div class="outline-text-4" id="text-2-5-4">
<p>
Probably just a tweak to this table, and might need to be a
"standard set" and a "this year set" like BaseFeatures and
Features does as well as BaseServices and Services does and a
repurposing of "SessionHasVendorSpace" to "VendorHasVendorSpace"
</p>
</div>
</li>

<li>Vendor Location<br  /><div class="outline-text-4" id="text-2-5-5">
<p>
Might be it's own table, with conid (linked), badgeid (linked),
building, floor, room (possibly linked), and booth_number, and
then code around it so blanks just don't get reported (aka, if
they are a room vendor, their booth_number might not be listed,
but if there are several vendors in a room, it might be.)  This
might also allow ties to maps, and possibly the redraw of maps.
</p>
</div>
</li>

<li>Vendor Status<br  /><div class="outline-text-4" id="text-2-5-6">
<p>
Might want to be it's own table as a mapping, so searches, and
display_order could be set.
</p>
</div>
</li>

<li>Vendor Sponsorship Package/vendor_sponsor_level<br  /><div class="outline-text-4" id="text-2-5-7">
<p>
These three would need to be determined.
</p>
</div>
</li>

<li>digital_advertising_level<br  /><div class="outline-text-4" id="text-2-5-8">
<p>
These three would need to be determined.
</p>
</div>
</li>

<li>print_advertising_level<br  /><div class="outline-text-4" id="text-2-5-9">
<p>
These three would need to be determined.
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Still Unknown</h3>
<div class="outline-text-3" id="text-2-6">
<p>
These are the variables that exist already in the other usage
space, that I still don't have a handle on.  More explination would
be very useful.
</p>
</div>
<ul class="org-ul"><li>created_by - number<br  /><div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>Not sure what this does?
</li>
<li>I THINK IT"S VENDORS NAME VS. I UPDATED, ETC
</li>
<li>So &#x2026; how should it be expressed/tracked?
</li>
</ul>
</div>
</li>

<li>ordering_count - number<br  /><div class="outline-text-4" id="text-2-6-2">
<ul class="org-ul">
<li>Another random number?
</li>
<li>YES
</li>
<li>Should it be kept?  Removed, what is it's state?  What is it's
purpose?
</li>
</ul>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Front End</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Available Pages</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This should be the comprehensive list of all the pages that either
the vendors/community table folk need to interact with or those who
manage them (the Div Head) needs to interact with.
</p>
</div>
<ul class="org-ul"><li>Returning Vendor sign-in<br  /><div class="outline-text-4" id="text-3-1-1">
<p>
By number or email address.
</p>
</div>
</li>

<li>Returning Community Table sign-in<br  /><div class="outline-text-4" id="text-3-1-2">
<p>
By number or email address.  Might simply be switched on one of
the values in the vending type or on it's own value, and just have
one place to go?  Since we are collecting pretty much the same
information for them both?  Or should I be separating them out?
</p>
</div>
</li>
