Documentation/Source/Vending_Design_Document.tex
\item single, double, room, etc. probably based on the same
VendorSpaces/VendorHasVendorSpace etc.
\end{itemize}

\item vendor\_location\_requests
\label{sec-2-3-5}
\begin{itemize}
\item although this might be under vendor notes?
\end{itemize}
\end{itemize}

\subsection{Generated}
\label{sec-2-4}
These values would not actually be stored anywhere, but generated
for various purposes, from other information collected in the
database, rather than simple values.  The Vendor Invoice Amount
should also go along with the Vendor Invoice, which lists all the
things they are paying for, and interfaces with our credit-card
system.
\begin{itemize}
\item vendor\_invoice\_amount - decimal(13,4)
\label{sec-2-4-1}
\begin{itemize}
\item Money
\item YUP
\item possibly a geneerated field, as opposed to a stored one, based
on the varieties chosen in vendor\_amenites,
vendor\_payment\_adjustment, vendor\_actual\_space and others?
\end{itemize}

\item times\_at\_fff
\label{sec-2-4-2}
\begin{itemize}
\item currently a freeform field, should probably be generated, with a
special number that adds in, for (currently) untracked events.
\item SOUNDS GOOD
\item Base figure above in perennial
\end{itemize}
\end{itemize}

\subsection{Structture}
\label{sec-2-5}
These are the proposed new tables or modifications to existing
tables that the data will be collected in.  Mostly interesting for
building purposes, but also for those curious on how things operate
under the hood, because, I like sharing that way, as opposed to
keeping things secret and cryptic.  Yes, I know it's called "code"
because we didn't want you to know what it did, but \ldots{} 
\begin{itemize}
\item Vendor Constants
\label{sec-2-5-1}
\begin{itemize}
\item Most of these (as listed) are already in the CongoDump table.
\item Two need their own table:
\begin{itemize}
\item vendor\_type
possibly a short list of possible with a mapping to the
vendor, so might be another table
\item times\_at\_fff\_untracked - int(3)
\end{itemize}
\end{itemize}

\item Vendor Yearly Variables
\label{sec-2-5-2}
\begin{itemize}
\item Most just are, as specified in this table
\item Some might be cross-references to the other tables below, or be
in the other tables entirely.
\end{itemize}

\item Vendor Features
\label{sec-2-5-3}
Probably just a tweak to this table, and might need to be a
"standard set" and a "this year set" like BaseFeatures and
Features does as well as BaseServices and Services does and a
repurposing of "SessionHasVendorFeature" to
"VendorHasVendorFeature"

\item Vendor Spaces
\label{sec-2-5-4}
Probably just a tweak to this table, and might need to be a
"standard set" and a "this year set" like BaseFeatures and
Features does as well as BaseServices and Services does and a
repurposing of "SessionHasVendorSpace" to "VendorHasVendorSpace"

\item Vendor Location
\label{sec-2-5-5}
Might be it's own table, with conid (linked), badgeid (linked),
building, floor, room (possibly linked), and booth\_number, and
then code around it so blanks just don't get reported (aka, if
they are a room vendor, their booth\_number might not be listed,
but if there are several vendors in a room, it might be.)  This
might also allow ties to maps, and possibly the redraw of maps.

\item Vendor Status
\label{sec-2-5-6}
Might want to be it's own table as a mapping, so searches, and
display\_order could be set.

\item Vendor Sponsorship Package/vendor\_sponsor\_level
\label{sec-2-5-7}
These three would need to be determined.

\item digital\_advertising\_level
\label{sec-2-5-8}
These three would need to be determined.

\item print\_advertising\_level
\label{sec-2-5-9}
These three would need to be determined.
\end{itemize}

\subsection{Still Unknown}
\label{sec-2-6}
These are the variables that exist already in the other usage
space, that I still don't have a handle on.  More explination would
be very useful.
\begin{itemize}
\item created\_by - number
\label{sec-2-6-1}
\begin{itemize}
\item Not sure what this does?
\item I THINK IT"S VENDORS NAME VS. I UPDATED, ETC
\item So \ldots{} how should it be expressed/tracked?
\end{itemize}

\item ordering\_count - number
\label{sec-2-6-2}
\begin{itemize}
\item Another random number?
\item YES
\item Should it be kept?  Removed, what is it's state?  What is it's
purpose?
\end{itemize}
\end{itemize}

\section{Front End}
\label{sec-3}
\subsection{Available Pages}
\label{sec-3-1}
This should be the comprehensive list of all the pages that either
the vendors/community table folk need to interact with or those who
manage them (the Div Head) needs to interact with.
\begin{itemize}
\item Returning Vendor sign-in
\label{sec-3-1-1}
By number or email address.

\item Returning Community Table sign-in
\label{sec-3-1-2}
By number or email address.  Might simply be switched on one of
the values in the vending type or on it's own value, and just have
one place to go?  Since we are collecting pretty much the same
information for them both?  Or should I be separating them out?
