Documentation/Source/Vending_Design_Document.org
*** New Vendor proposal
    With a catch to see if they are already in our database, using
    their email address
*** New Community Table proposal
    With a catch to see if they are already in our database, using
    their email address
*** Returning Vendor/Community Table informational gathering
    This can be the same, although there might, again, be a slight
    difference bases on vendor/community table differences.  Also, we
    might want to present last? event's information as defaults, so
    they have to do less typing. Dealing with changes once the state
    has changed to "invoice generated" might require Vendor Div Head
    intervention.
*** Returning Vendor informational update
    This might not be necessary, based on the above page keeping what
    is set for this year as set.
*** Returning Vendor/Community Table Bio update
    Page that they can, at will? update their web or book information.
*** Invoice
    Not available until after both they are accepted (by Vendor
    Div Head), and they hit the "generate invoice" button, which
    probably should lock changes.  Once the invoice is generated, it
    should be fixed, and also payable.
    This will (of course) be a comprehensive list of everything they
    agreed to.  The invoice page should continue to be available after
    they paid, so there is a referece point to the services agreed
    to/paid for.
*** Ad Copy Submissions
    For those who have agreed to either digital or print ads, this is
    a place for them to upload/submit them.
*** Vendor Jury
    The page that all the proposed vendors, with certain bits of
    information (to be determined, since I've not seen that page yet
    in our current system) will be on for the Vendor Div Head to move
    vendors to either "Accepted" or "Denied".  Probably includes some
    vendor notes and the like, including "Denied Reasons" Also
    probably where any price adjustments happen to the invoice.  Maybe
    a grouping by Vendor Type, and leaving the ones already moved on
    from this in a different colour, so that those already accepted,
    and their type, will be shown for balance reasons.
*** Vendor Placement
    After the invoice is paid? Or perhaps slightly different, if there
    is those that have invoice exceptions allowing for the placement
    of vendors.  Probably should have the invoice amount paid, and
    invoice amount expected on this page, to verify that they are,
    indeed, all paid up.  Also the vendor type should show up here, as
    well, so that similars can either be grouped together, or spread
    apart, as per the decision of the Div Head. May also contain
    previous placements, or links to previous maps or something useful
    along those lines.
*** Administer Vendor
    Where any changes are made to the vendor information (both that
    they can change and that they can't) for creation/update by Vendor
    Div Head.
*** Vendor Welcome Letter
    Generate the (physical) welcome letter to the vendors
*** Vendor Email
    Generate (and send) various all-vendor communications
*** Vendor Badges
    Generate the Vendor Badges for printing purposes.
*** Vendor Tents
    Generate all the vendor "tents" to put on their tables, to mark
    their place.
*** Check-in/Check-out lists
    All of the vendors expected, so they can be ticked off the list
    when they get there, and, so that when they return whatever they
    have to return at the end of the night (tax forms, possibly?) can
    be ticked off again.
** Flow
*** Task List
    Task List element with the call for vendors is created, with the
    appropriate link.
*** Task List
    Task List element with the call for community tables is created,
    with the appropriate link.
*** Email
    Possible email from Vendor Div Head goes out reminding
    vendors/community tables when the call will open and close.
*** Phase Change
    At the appropriate time, the Con Chair or Zambia bitch open the
    call for vendors.
*** Email
    Vendor Div Head generates and sends email letting the
    vendors/community tables know that the call is open.
*** Vendors/Community Table folk apply
    They use either the returning or the new pages, select the
    appropriate features, sponsorships, and ads that they want, and
    make sure everything is as expected.
*** (If Rolling Acceptance) Jury
    If there is a rolling acceptantce of vendors and/or community
    tables, while the vendor call/community table call is open
    acceptances can roll out and then things can go forward.
    Otherwise ...
*** Phase Change
    At the appropriate time, the Con Chair or Zambia bitch close the
    call for vendors.
