Documentation/Vending_Design_Document.html

<li>New Vendor proposal<br  /><div class="outline-text-4" id="text-3-1-3">
<p>
With a catch to see if they are already in our database, using
their email address
</p>
</div>
</li>

<li>New Community Table proposal<br  /><div class="outline-text-4" id="text-3-1-4">
<p>
With a catch to see if they are already in our database, using
their email address
</p>
</div>
</li>

<li>Returning Vendor/Community Table informational gathering<br  /><div class="outline-text-4" id="text-3-1-5">
<p>
This can be the same, although there might, again, be a slight
difference bases on vendor/community table differences.  Also, we
might want to present last? event's information as defaults, so
they have to do less typing. Dealing with changes once the state
has changed to "invoice generated" might require Vendor Div Head
intervention.
</p>
</div>
</li>

<li>Returning Vendor informational update<br  /><div class="outline-text-4" id="text-3-1-6">
<p>
This might not be necessary, based on the above page keeping what
is set for this year as set.
</p>
</div>
</li>

<li>Returning Vendor/Community Table Bio update<br  /><div class="outline-text-4" id="text-3-1-7">
<p>
Page that they can, at will? update their web or book information.
</p>
</div>
</li>

<li>Invoice<br  /><div class="outline-text-4" id="text-3-1-8">
<p>
Not available until after both they are accepted (by Vendor
Div Head), and they hit the "generate invoice" button, which
probably should lock changes.  Once the invoice is generated, it
should be fixed, and also payable.
This will (of course) be a comprehensive list of everything they
agreed to.  The invoice page should continue to be available after
they paid, so there is a referece point to the services agreed
to/paid for.
</p>
</div>
</li>

<li>Ad Copy Submissions<br  /><div class="outline-text-4" id="text-3-1-9">
<p>
For those who have agreed to either digital or print ads, this is
a place for them to upload/submit them.
</p>
</div>
</li>

<li>Vendor Jury<br  /><div class="outline-text-4" id="text-3-1-10">
<p>
The page that all the proposed vendors, with certain bits of
information (to be determined, since I've not seen that page yet
in our current system) will be on for the Vendor Div Head to move
vendors to either "Accepted" or "Denied".  Probably includes some
vendor notes and the like, including "Denied Reasons" Also
probably where any price adjustments happen to the invoice.  Maybe
a grouping by Vendor Type, and leaving the ones already moved on
from this in a different colour, so that those already accepted,
and their type, will be shown for balance reasons.
</p>
</div>
</li>

<li>Vendor Placement<br  /><div class="outline-text-4" id="text-3-1-11">
<p>
After the invoice is paid? Or perhaps slightly different, if there
is those that have invoice exceptions allowing for the placement
of vendors.  Probably should have the invoice amount paid, and
invoice amount expected on this page, to verify that they are,
indeed, all paid up.  Also the vendor type should show up here, as
well, so that similars can either be grouped together, or spread
apart, as per the decision of the Div Head. May also contain
previous placements, or links to previous maps or something useful
along those lines.
</p>
</div>
</li>

<li>Administer Vendor<br  /><div class="outline-text-4" id="text-3-1-12">
<p>
Where any changes are made to the vendor information (both that
they can change and that they can't) for creation/update by Vendor
Div Head.
</p>
</div>
</li>

<li>Vendor Welcome Letter<br  /><div class="outline-text-4" id="text-3-1-13">
<p>
Generate the (physical) welcome letter to the vendors
</p>
</div>
</li>

<li>Vendor Email<br  /><div class="outline-text-4" id="text-3-1-14">
<p>
Generate (and send) various all-vendor communications
</p>
</div>
</li>

<li>Vendor Badges<br  /><div class="outline-text-4" id="text-3-1-15">
<p>
Generate the Vendor Badges for printing purposes.
</p>
</div>
</li>

<li>Vendor Tents<br  /><div class="outline-text-4" id="text-3-1-16">
<p>
Generate all the vendor "tents" to put on their tables, to mark
their place.
</p>
</div>
</li>

<li>Check-in/Check-out lists<br  /><div class="outline-text-4" id="text-3-1-17">
<p>
All of the vendors expected, so they can be ticked off the list
when they get there, and, so that when they return whatever they
have to return at the end of the night (tax forms, possibly?) can
be ticked off again.
</p>
</div>
</li></ul>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Flow</h3>
<div class="outline-text-3" id="text-3-2">
</div><ul class="org-ul"><li>Task List<br  /><div class="outline-text-4" id="text-3-2-1">
<p>
Task List element with the call for vendors is created, with the
appropriate link.
</p>
</div>
</li>

<li>Task List<br  /><div class="outline-text-4" id="text-3-2-2">
<p>
Task List element with the call for community tables is created,
with the appropriate link.
</p>
</div>
</li>

<li>Email<br  /><div class="outline-text-4" id="text-3-2-3">
<p>
Possible email from Vendor Div Head goes out reminding
vendors/community tables when the call will open and close.
</p>
</div>
</li>

<li>Phase Change<br  /><div class="outline-text-4" id="text-3-2-4">
<p>
At the appropriate time, the Con Chair or Zambia bitch open the
call for vendors.
</p>
</div>
</li>

<li>Email<br  /><div class="outline-text-4" id="text-3-2-5">
<p>
Vendor Div Head generates and sends email letting the
vendors/community tables know that the call is open.
</p>
</div>
</li>

<li>Vendors/Community Table folk apply<br  /><div class="outline-text-4" id="text-3-2-6">
<p>
They use either the returning or the new pages, select the
appropriate features, sponsorships, and ads that they want, and
make sure everything is as expected.
</p>
</div>
</li>

<li>(If Rolling Acceptance) Jury<br  /><div class="outline-text-4" id="text-3-2-7">
<p>
If there is a rolling acceptantce of vendors and/or community
tables, while the vendor call/community table call is open
acceptances can roll out and then things can go forward.
Otherwise &#x2026;
</p>
</div>
</li>

<li>Phase Change<br  /><div class="outline-text-4" id="text-3-2-8">
<p>
At the appropriate time, the Con Chair or Zambia bitch close the
call for vendors.
</p>
</div>
</li>

<li>Jury<br  /><div class="outline-text-4" id="text-3-2-9">
<p>
