Documentation/Source/Vending_Design_Document.tex

\item New Vendor proposal
\label{sec-3-1-3}
With a catch to see if they are already in our database, using
their email address

\item New Community Table proposal
\label{sec-3-1-4}
With a catch to see if they are already in our database, using
their email address

\item Returning Vendor/Community Table informational gathering
\label{sec-3-1-5}
This can be the same, although there might, again, be a slight
difference bases on vendor/community table differences.  Also, we
might want to present last? event's information as defaults, so
they have to do less typing. Dealing with changes once the state
has changed to "invoice generated" might require Vendor Div Head
intervention.

\item Returning Vendor informational update
\label{sec-3-1-6}
This might not be necessary, based on the above page keeping what
is set for this year as set.

\item Returning Vendor/Community Table Bio update
\label{sec-3-1-7}
Page that they can, at will? update their web or book information.

\item Invoice
\label{sec-3-1-8}
Not available until after both they are accepted (by Vendor
Div Head), and they hit the "generate invoice" button, which
probably should lock changes.  Once the invoice is generated, it
should be fixed, and also payable.
This will (of course) be a comprehensive list of everything they
agreed to.  The invoice page should continue to be available after
they paid, so there is a referece point to the services agreed
to/paid for.

\item Ad Copy Submissions
\label{sec-3-1-9}
For those who have agreed to either digital or print ads, this is
a place for them to upload/submit them.

\item Vendor Jury
\label{sec-3-1-10}
The page that all the proposed vendors, with certain bits of
information (to be determined, since I've not seen that page yet
in our current system) will be on for the Vendor Div Head to move
vendors to either "Accepted" or "Denied".  Probably includes some
vendor notes and the like, including "Denied Reasons" Also
probably where any price adjustments happen to the invoice.  Maybe
a grouping by Vendor Type, and leaving the ones already moved on
from this in a different colour, so that those already accepted,
and their type, will be shown for balance reasons.

\item Vendor Placement
\label{sec-3-1-11}
After the invoice is paid? Or perhaps slightly different, if there
is those that have invoice exceptions allowing for the placement
of vendors.  Probably should have the invoice amount paid, and
invoice amount expected on this page, to verify that they are,
indeed, all paid up.  Also the vendor type should show up here, as
well, so that similars can either be grouped together, or spread
apart, as per the decision of the Div Head. May also contain
previous placements, or links to previous maps or something useful
along those lines.

\item Administer Vendor
\label{sec-3-1-12}
Where any changes are made to the vendor information (both that
they can change and that they can't) for creation/update by Vendor
Div Head.

\item Vendor Welcome Letter
\label{sec-3-1-13}
Generate the (physical) welcome letter to the vendors

\item Vendor Email
\label{sec-3-1-14}
Generate (and send) various all-vendor communications

\item Vendor Badges
\label{sec-3-1-15}
Generate the Vendor Badges for printing purposes.

\item Vendor Tents
\label{sec-3-1-16}
Generate all the vendor "tents" to put on their tables, to mark
their place.

\item Check-in/Check-out lists
\label{sec-3-1-17}
All of the vendors expected, so they can be ticked off the list
when they get there, and, so that when they return whatever they
have to return at the end of the night (tax forms, possibly?) can
be ticked off again.
\end{itemize}

\subsection{Flow}
\label{sec-3-2}
\begin{itemize}
\item Task List
\label{sec-3-2-1}
Task List element with the call for vendors is created, with the
appropriate link.

\item Task List
\label{sec-3-2-2}
Task List element with the call for community tables is created,
with the appropriate link.

\item Email
\label{sec-3-2-3}
Possible email from Vendor Div Head goes out reminding
vendors/community tables when the call will open and close.

\item Phase Change
\label{sec-3-2-4}
At the appropriate time, the Con Chair or Zambia bitch open the
call for vendors.

\item Email
\label{sec-3-2-5}
Vendor Div Head generates and sends email letting the
vendors/community tables know that the call is open.

\item Vendors/Community Table folk apply
\label{sec-3-2-6}
They use either the returning or the new pages, select the
appropriate features, sponsorships, and ads that they want, and
make sure everything is as expected.

\item (If Rolling Acceptance) Jury
\label{sec-3-2-7}
If there is a rolling acceptantce of vendors and/or community
tables, while the vendor call/community table call is open
acceptances can roll out and then things can go forward.
Otherwise \ldots{}

\item Phase Change
\label{sec-3-2-8}
At the appropriate time, the Con Chair or Zambia bitch close the
call for vendors.

\item Jury
\label{sec-3-2-9}
