Documentation/Source/Vending_Design_Document.org
*** Jury
    The (rest of (if rolling acceptance is happening)) vendors and
    community tables get acceptance, which probably is an individual
    email from the Div Head, with any specific to them in information
    included, and an invitation for them to pay their invoice.
*** Invoice
    Vendors then (hopefully, magically, smoothly) pay their agreed-to
    invoices.
*** Ad Copy
    All paid for advertizing copy is generated by the vendors or
    community tables is submitted.
*** Placement
    Div Head (and anyone else that can be roped into helping)
    schedules the vendors to be put in the appropriate locations on
    the day of the event.
*** Email
    Final email goes out, with any instruction reminders and if there
    is a manditory vendor meeting, or the like.
*** Welcome Letter
    Welcome lettters generated and printed, possibly stuffed in an
    envelope or folder of some sort.
    This might include some form of their (electronically) signed
    contract, and maybe invoice highlights.  Definitely includes their
    placement information, and information on how load-in and load-out
    works, etc.
*** Badges
    Badges, the appropriate number for each vendor and community
    table, are printed, and possibly stuffed as above.
*** Wrist bands
    Are possibly stuffed as above.
*** Check-in/check-out lists printed
    So they are available on the day-of.
* Conclusion
  This should cover all the bits and pieces.  If I missed any, let me
  know so this document can be updated, and the system can be tested.
  Hopfully all will work, and this can go forth as The New Way.  Until
  we change it, again, in 2-3 years *grin*.
