Documentation/Vending_Design_Document.html
The (rest of (if rolling acceptance is happening)) vendors and
community tables get acceptance, which probably is an individual
email from the Div Head, with any specific to them in information
included, and an invitation for them to pay their invoice.
</p>
</div>
</li>

<li>Invoice<br  /><div class="outline-text-4" id="text-3-2-10">
<p>
Vendors then (hopefully, magically, smoothly) pay their agreed-to
invoices.
</p>
</div>
</li>

<li>Ad Copy<br  /><div class="outline-text-4" id="text-3-2-11">
<p>
All paid for advertizing copy is generated by the vendors or
community tables is submitted.
</p>
</div>
</li>

<li>Placement<br  /><div class="outline-text-4" id="text-3-2-12">
<p>
Div Head (and anyone else that can be roped into helping)
schedules the vendors to be put in the appropriate locations on
the day of the event.
</p>
</div>
</li>

<li>Email<br  /><div class="outline-text-4" id="text-3-2-13">
<p>
Final email goes out, with any instruction reminders and if there
is a manditory vendor meeting, or the like.
</p>
</div>
</li>

<li>Welcome Letter<br  /><div class="outline-text-4" id="text-3-2-14">
<p>
Welcome lettters generated and printed, possibly stuffed in an
envelope or folder of some sort.
This might include some form of their (electronically) signed
contract, and maybe invoice highlights.  Definitely includes their
placement information, and information on how load-in and load-out
works, etc.
</p>
</div>
</li>

<li>Badges<br  /><div class="outline-text-4" id="text-3-2-15">
<p>
Badges, the appropriate number for each vendor and community
table, are printed, and possibly stuffed as above.
</p>
</div>
</li>

<li>Wrist bands<br  /><div class="outline-text-4" id="text-3-2-16">
<p>
Are possibly stuffed as above.
</p>
</div>
</li>

<li>Check-in/check-out lists printed<br  /><div class="outline-text-4" id="text-3-2-17">
<p>
So they are available on the day-of.
</p>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
This should cover all the bits and pieces.  If I missed any, let me
know so this document can be updated, and the system can be tested.
Hopfully all will work, and this can go forth as The New Way.  Until
we change it, again, in 2-3 years <b>grin</b>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: May 2017</p>
<p class="author">Author: Percy, Amanda, Rob, Iya</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>